# -*- coding: utf-8 -*-
"""
문3) 입력변수(x)를 실인수로 넣어서 정의된 sigmoid 함수를 호출하여 
     아래와 같은 <출력 결과>가 나타나도록 양식을 적용하여 출력하시오.      
     
         <출력 결과>  
 x : -5.0 -> y : 0.006692850962281227
 x : -4.0 -> y : 0.01798621006309986
 x : -3.0 -> y : 0.04742587357759476
 x : -2.0 -> y : 0.11920291930437088
 x : -1.0 -> y : 0.2689414322376251
 x : 0.0 -> y : 0.5
 x : 1.0 -> y : 0.7310585975646973
 x : 2.0 -> y : 0.8807970285415649
 x : 3.0 -> y : 0.9525741338729858
 x : 4.0 -> y : 0.9820137619972229
 x : 5.0 -> y : 0.9933071732521057   
"""

import tensorflow as tf # exp() 함수 사용  
import numpy as np # 입력변수(x변수) 생성  


# 1. sigmoid 함수 정의 
def sigmoid(x) : # x : 입력변수 
    ex = tf.math.exp(-x)
    y = 1 / (1 + ex)
    return y # y : 출력변수


# 2. 입력변수(x) : 실인수 
x_data = np.arange(-5.0, 6.0) # -5.0 ~ +5.0 


# 3. 결과 출력 : 함수호출(x) -> 출력(y) 

    
    
    
    
    
    
    
    
    
    
    
    
    
    
    